#Да си направим програмка за запознанства.
#В едно list-че сме си съчинили малко информация за момиченца и момченца.
# От данните, програмата трябва да изведе резултати кои хора биха си паснали,
# съгласно следните правила:
#момиченце с момченце; ако сте по-свободомислещи, можете да комбинирате
# и момченце с момченце, но все пак да има някакво правило :о);
#трябва да имат поне един общ интерес;
#Примерен резултат:

#Мария и Георги - общ интерес: плуване


people = [
    {
        'name': "Мария",
        'interests': ['пътуване', 'танци', 'плуване', 'кино'],
        'gender': "female",
    },
    {
        'name': "Диана",
        'interests': ['мода', 'спортна стрелба', 'четене', 'скандинавска поезия'],
        'gender': "female",
    },
    {
        'name': "Дарина",
        'interests': ['танци', 'покер', 'история', 'софтуер'],
        'gender': "female",
    },
    {
        'name': "Лилия",
        'interests': ['покер', 'автомобили', 'танци', 'кино'],
        'gender': "female",
    },
    {
        'name': "Галя",
        'interests': ['пътуване', 'автомобили', 'плуване', 'баскетбол'],
        'gender': "female",
    },
    {
        'name': "Валерия",
        'interests': ['плуване', 'покер', 'наука', 'скандинавска поезия'],
        'gender': "female",
    },
    {
        'name': "Ина",
        'interests': ['кино', 'лов със соколи', 'пътуване', 'мода'],
        'gender': "female",
    },
    {
        'name': "Кирил",
        'interests': ['баскетбол', 'автомобили', 'кино', 'наука'],
        'gender': "male",
    },
    {
        'name': "Георги",
        'interests': ['автомобили', 'футбол', 'плуване', 'танци'],
        'gender': "male",
    },
    {
        'name': "Андрей",
        'interests': ['футбол', 'скандинавска поезия', 'история', 'танци'],
        'gender': "male",
    },
    {
        'name': "Емил",
        'interests': ['летене', 'баскетбол', 'софтуер', 'наука'],
        'gender': "male",
    },
    {
        'name': "Димитър",
        'interests': ['футбол', 'лов със соколи', 'автомобили', 'баскетбол'],
        'gender': "male",
    },
    {
        'name': "Петър",
        'interests': ['пътуване', 'покер', 'баскетбол', 'лов със соколи'],
        'gender': "male",
    },
    {
        'name': "Калоян",
        'interests': ['история', 'покер', 'пътуване', 'автомобили'],
        'gender': "male",
    },
]

girls = []
boys = []
for person in people:
    if person.get('gender', None) == 'male' :
        boys.append(person)
    else:
        girls.append(person)
for boy in boys:
    for girl in girls:
        boy_interests = set(boy['interests'])
        girl_interests = set(girl['interests'])
        if boy_interests & girl_interests:
            print("{} и {} - интереси: {}".format(boy['name'], girl['name'], boy_interests & girl_interests))
            break
